{"id":2143,"date":"2022-06-29T10:54:45","date_gmt":"2022-06-29T10:54:45","guid":{"rendered":"https:\/\/bibledit.org\/?page_id=2143"},"modified":"2022-06-30T13:27:29","modified_gmt":"2022-06-30T13:27:29","slug":"scrum-based-translation","status":"publish","type":"page","link":"https:\/\/bibledit.org\/scrum-based-translation\/","title":{"rendered":"Scrum-based Translation"},"content":{"rendered":"\n<div style=\"height:68px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2>Scrum-based Translation<\/h2>\n\n\n\n<h3>Introduction<\/h3>\n\n\n\n<p>What is Scrum-based translation? A translation team that works with Scrum frequently releases portions of translated Scripture. This makes it clear to involved parties where the translation project is going. It enables the translation team to make course corrections based on the facts. Burndown charts and the product backlog provide the product owner and others with a permanent overview over the translation status and progress. Scrum is an agile process that enables self-organizing translation teams to deliver high translation output and accuracy in a short time. Using iterative translation, it releases portions of translated Scripture every iteration, say, every month. At the end of the every sprint, anyone can see the translated portion, and decide whether to release it to the congregations and community for feedback or continue to enhance it.<\/p>\n\n\n\n<p>The introduction and the following explanation just outlines the mechanics of Scrum-based Translation. It does not make clear what difficulties and issues you will run into trying to implement it. It only hints at the agile spirit that&#8217;s required to make it work. If you&#8217;re interested in implementing Scrum-based translation, do some reading, watch videos, follow a course, find a mentor or coach.<\/p>\n\n\n\n<h3>Product Owner<\/h3>\n\n\n\n<p>The Product Owner represents the stakeholders. He or she is the voice of the target audience, that is the Bible reader. He understands the requirements for the Bible. The Product Owner may also be a group of people in a committee.<\/p>\n\n\n\n<p>He is responsible for ensuring that the team delivers accuracy and reliability to the Bible translation. He knows about accuracy and reliability.<\/p>\n\n\n\n<p>He defines items that focus on desired features. He makes decisions as to whether to implement footnotes or leave them out. In the same way, he defines other features, like headers, introductions, or decides to leave them out. He decides about use or non-use of a dialect.<\/p>\n\n\n\n<p>He sets the priorities for the work to be done. He adds the items to the product backlog.<\/p>\n\n\n\n<p>Scrum teams should have one Product Owner. The Product Owner may be part of the Translation Team, but it is recommended that his role not be combined with the role of Scrum Master.<\/p>\n\n\n\n<h3>Release Planning<\/h3>\n\n\n\n<p>The release planning shows which parts of the Bible will be translated and delivered during which Sprint. It is convenient to define a Sprint in months, so that the release planning mentions January, February, and so on.<\/p>\n\n\n\n<p>It is often helpful to stick the release planning to the wall so that everybody can see the grand picture.<\/p>\n\n\n\n<p>The advantages of a release planning are:<\/p>\n\n\n\n<p>1. It gives the team a common vision about what needs to be achieved, and when.<\/p>\n\n\n\n<p>2. It guides the team to make decisions during detailed planning.<\/p>\n\n\n\n<p>3. It helps prioritize the actions.<\/p>\n\n\n\n<p>4. It resolves conflicts and guides the teams toward the right balance on trade-offs.<\/p>\n\n\n\n<p>Release each completed Bible book to the community and get their feedback. This implements the important principle of continual improvement.<\/p>\n\n\n\n<p>The release planning is a simple way of doing top-down planning. It is an estimate, simple and quick to do. It is based on the Product Backlog.<\/p>\n\n\n\n<h3>Product Backlog<\/h3>\n\n\n\n<p>The product backlog is an ordered list of requirements that is maintained for the Bible translation. It consists of translation tasks, checking tasks, testing tasks, comprehension tasks, whatever needs to be done to deliver a reliable manuscript.<\/p>\n\n\n\n<p>The Product Owner prioritizes the items on this list. It is used to determine the work for the next sprints. Each item has an associated estimated time to complete.<\/p>\n\n\n\n<h3>Sprint<\/h3>\n\n\n\n<p>A sprint typically takes one month.<\/p>\n\n\n\n<p>This is where the translaton work (translate, review, approve, test) occurs.<\/p>\n\n\n\n<p>Each member of the team translates independently and in a responsible manner. In case a translator is sure of a required change, he enters it without consulting others. If a translator thinks a proposed change needs discussion, he notifies his colleagues.<\/p>\n\n\n\n<p>All members of the translation team review the changes made by the team. This is to make sure that all changes are reviewed by all members, that no mistakes occur. The reviews take place every day.<\/p>\n\n\n\n<p>This way of working is based on personal responsibility and mutual trust. It speeds up the translation procedure because there&#8217;s more actual translation work going on, and less discussions. The newer members of the team learn from the more experienced ones through the daily reviews.<\/p>\n\n\n\n<p>Bibledit has the concept of daily Change Notifications. A member can opt to receive the Change Notifications through email. This email can be viewed online also. Or a member can opt to have the Change Notifications generated for him online, and can review and approve them there.<\/p>\n\n\n\n<h3>Sprint Planning Meeting<\/h3>\n\n\n\n<p>During this meeting the team selects the portions to translate, review and test it believes it can commit to in a sprint.<\/p>\n\n\n\n<p>The team breaks the portions down into tasks and provided estimates for those tasks as to the time it takes to complete them.<\/p>\n\n\n\n<h3>Sprint Backlog<\/h3>\n\n\n\n<p>The sprint backlog is a list of tasks to be completed in a sprint. The tasks are created by breaking down the product backlog items during the planning meeting.The tasks have estimates in hours or days associated with them.<\/p>\n\n\n\n<p>For a team it is vitally important to have a clear goal to work towards. Thus everybody is focused on the desired outcome, and keeps a good pace. Without a clear goal, the team may still do a lot of things and work hard, but the produced results may not have the desired value.<\/p>\n\n\n\n<h3>Team<\/h3>\n\n\n\n<p>The team consistes of the Bible translators, their assistants, and the consultants.<\/p>\n\n\n\n<p>The team organizes itself to carry out the work and deliver a reliable and good Bible translation.<\/p>\n\n\n\n<p>The team is quick but does not hurry. The team goes fast, but always has an eye on translation quality.<\/p>\n\n\n\n<h3>Scrum Master<\/h3>\n\n\n\n<p>The scrum master organizes the translation process.<\/p>\n\n\n\n<p>He or she keeps track of the progress of the translation team.<\/p>\n\n\n\n<p>He removes obstacles from the path of the team.<\/p>\n\n\n\n<h3>Daily Scrum Meeting<\/h3>\n\n\n\n<p>On each day of a sprint, the Bible translation team holds daily meetings. These meetings are called: Daily scrum meetings. The scrum meetings are held in the same place and at the same time. The meetings are typically held in front of Task Board. The daily scrum meeting is best held in the morning, because it assists in setting the context for the work of that day. During the meeting, all members stand, as this keeps the discussion short and relevant. The scrum meeting is strictly time-boxed to 15 minutes.<\/p>\n\n\n\n<p>There is a difference between people who are &#8216;committed&#8217; to the Bible translation project, and those who are &#8216;involved&#8217; in it. Scrum affords special status to those who are committed. Many teams enforce a rule in which only those who are committed are allowed to talk during the daily scrum meeting.<\/p>\n\n\n\n<p>All team members are required to attend the scrum meetings. The Scrum Master and the and Product Owner (usually the Bible Translation Manager) are committed team members. They are expected to attend and participate. Anyone else, for example a Church leader, a Committee member, or a Translator from another team, is allowed to attend but is there to listen only. This makes the daily scrum meeting an excellent way for a scrum team to disseminate information. If you are interested in hearing the status of the project, attend that day&#8217;s meeting.<\/p>\n\n\n\n<p>The scrum meeting is not the place for solving problems or resolving issues. Issues that are raised are usually dealt with by one or two team members immediately after the scrum.<\/p>\n\n\n\n<p>During the daily Scrum, each team member answers the following three questions:<\/p>\n\n\n\n<p>1. What did you do yesterday?<\/p>\n\n\n\n<p>2. What are you going to do today?<\/p>\n\n\n\n<p>3. Are there any impediments in your way?<\/p>\n\n\n\n<p>The Scrum Master asks each team member to answer these questions, the member speaks, the Scrum Master thanks the member, and then goes to the next member.<\/p>\n\n\n\n<p>By focusing on what each person did yesterday and will do today, the team gains an understanding of what work has been done and what work remains. The daily scrum meeting is not a status update meeting in which the boss is finding out about who is slow in his work. Rather, it is a meeting in which team members make commitments to each other. If a translator says: Today, I will prepare chapter 10 and 11 of Matthew, everyone knows that in tomorrow&#8217;s meeting, he will say whether or not he did finish. This has the wonderful effect of helping a team realize the significance of these commitments, and that their commitments are to each other, and not to anyone else.<\/p>\n\n\n\n<p>Any impediments that are raised in the daily scrums become the Scrum Master&#8217;s responsibility to resolve as quickly as possible. Typical impediments are:<\/p>\n\n\n\n<p>1. My &#8230; broke and I need a new one today.<\/p>\n\n\n\n<p>2. I still haven&#8217;t got the &#8230; I requested a month ago.<\/p>\n\n\n\n<p>3. I&#8217;m struggling to understand &#8230; and would like to discuss it with someone.<\/p>\n\n\n\n<p>4. The &#8230; has asked me to work on something else for a few days.<\/p>\n\n\n\n<p>In cases where the Scrum Master cannot remove these impediments directly himself, he still takes responsibility for making sure someone on the team does quickly resolve the issue.<\/p>\n\n\n\n<p>Every day a different person leads the daily scrum meeting. This gets the entire team involved. It opens up new channels for communication. It builds trust between the Translators and the Scrum Master. Team members can learn from one another&#8217;s techniques. The Scrum Master ensures to set a good example for leading the daily scrum meeting.<\/p>\n\n\n\n<p>The scrum master uses the information from the meeting to update the burndown chart illustrating progress.<\/p>\n\n\n\n<p>Side conversations are taken offline.<\/p>\n\n\n\n<p><a href=\"http:\/\/en.wikipedia.org\/wiki\/Stand-up_meeting\" target=\"_blank\" rel=\"noreferrer noopener\">External reference<\/a><\/p>\n\n\n\n<h3>Burn down chart<\/h3>\n\n\n\n<p>A burn down chart is a graphical representation of work left to do versus time. The outstanding work is on the vertical axis. The days of the sprint are on the horizontal axis. It is useful for predicting when all of the work will be completed.<\/p>\n\n\n\n<p><a href=\"http:\/\/en.wikipedia.org\/wiki\/Burn_down_chart\" target=\"_blank\" rel=\"noreferrer noopener\">External reference<\/a><\/p>\n\n\n\n<h3>Sprint Review<\/h3>\n\n\n\n<p>The Product Owner looks through the sprint’s work and provides feedback.<\/p>\n\n\n\n<p>The Translators may demonstrate features.<\/p>\n\n\n\n<p>The Team owns up to deficiencies with the translation.<\/p>\n\n\n\n<p>This attitude helps to build trust with the Product Owner.<\/p>\n\n\n\n<h3>Sprint Retrospective<\/h3>\n\n\n\n<p>The Team reviews what went well and what went poorly.<\/p>\n\n\n\n<p>They use retrospection techniques to find potential for improvement.<\/p>\n\n\n\n<p>They pick one or two areas to focus for improvement.<\/p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><a href=\"https:\/\/bibledit.org\/?customize_changeset_uuid=f7f1b40e-e38b-4dd9-8dd7-4f54b6b3e89d&amp;customize_messenger_channel=preview-3\" target=\"_blank\" rel=\"noreferrer noopener\">Home<\/a><br><a href=\"https:\/\/map.bloomfire.com\/posts\/2714971-update-on-bibledit\" target=\"_blank\" rel=\"noreferrer noopener\">Review<\/a><\/p>\n\n\n\n<div style=\"height:63px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Scrum-based Translation Introduction What is Scrum-based translation? A translation team that works with Scrum frequently releases portions of translated Scripture. This makes it clear to involved parties where the translation project is going. It enables the translation team to make course corrections based on the facts. Burndown charts and the product backlog provide the product&hellip;&nbsp;<a href=\"https:\/\/bibledit.org\/scrum-based-translation\/\" class=\"\" rel=\"bookmark\">Read More &raquo;<span class=\"screen-reader-text\">Scrum-based Translation<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"tpgb_global_settings":"","_mi_skip_tracking":false,"neve_meta_sidebar":"","neve_meta_container":"contained","neve_meta_enable_content_width":"on","neve_meta_content_width":70,"neve_meta_title_alignment":"","neve_meta_author_avatar":"","neve_post_elements_order":"","neve_meta_disable_header":"","neve_meta_disable_footer":"","neve_meta_disable_title":"on","_ti_tpc_template_sync":false,"_ti_tpc_template_id":""},"aioseo_notices":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Scrum-based Translation | Bibledit<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/bibledit.org\/scrum-based-translation\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Scrum-based Translation | Bibledit\" \/>\n<meta property=\"og:description\" content=\"Scrum-based Translation Introduction What is Scrum-based translation? A translation team that works with Scrum frequently releases portions of translated Scripture. This makes it clear to involved parties where the translation project is going. It enables the translation team to make course corrections based on the facts. Burndown charts and the product backlog provide the product&hellip;&nbsp;Read More &raquo;Scrum-based Translation\" \/>\n<meta property=\"og:url\" content=\"https:\/\/bibledit.org\/scrum-based-translation\/\" \/>\n<meta property=\"og:site_name\" content=\"Bibledit\" \/>\n<meta property=\"article:modified_time\" content=\"2022-06-30T13:27:29+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/bibledit.org\/scrum-based-translation\/\",\"url\":\"https:\/\/bibledit.org\/scrum-based-translation\/\",\"name\":\"Scrum-based Translation | Bibledit\",\"isPartOf\":{\"@id\":\"https:\/\/bibledit.org\/#website\"},\"datePublished\":\"2022-06-29T10:54:45+00:00\",\"dateModified\":\"2022-06-30T13:27:29+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/bibledit.org\/scrum-based-translation\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/bibledit.org\/scrum-based-translation\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/bibledit.org\/scrum-based-translation\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/bibledit.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Scrum-based Translation\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/bibledit.org\/#website\",\"url\":\"https:\/\/bibledit.org\/\",\"name\":\"Bibledit\",\"description\":\"Bible Translation Software\",\"publisher\":{\"@id\":\"https:\/\/bibledit.org\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/bibledit.org\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/bibledit.org\/#organization\",\"name\":\"FreeSoftwareConsultants\",\"url\":\"https:\/\/bibledit.org\/\",\"sameAs\":[],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/bibledit.org\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/bibledit.org\/wp-content\/uploads\/2022\/06\/cropped-bibleditlogoinkscape-copy.png\",\"contentUrl\":\"https:\/\/bibledit.org\/wp-content\/uploads\/2022\/06\/cropped-bibleditlogoinkscape-copy.png\",\"width\":200,\"height\":108,\"caption\":\"FreeSoftwareConsultants\"},\"image\":{\"@id\":\"https:\/\/bibledit.org\/#\/schema\/logo\/image\/\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Scrum-based Translation | Bibledit","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/bibledit.org\/scrum-based-translation\/","og_locale":"en_US","og_type":"article","og_title":"Scrum-based Translation | Bibledit","og_description":"Scrum-based Translation Introduction What is Scrum-based translation? A translation team that works with Scrum frequently releases portions of translated Scripture. This makes it clear to involved parties where the translation project is going. It enables the translation team to make course corrections based on the facts. Burndown charts and the product backlog provide the product&hellip;&nbsp;Read More &raquo;Scrum-based Translation","og_url":"https:\/\/bibledit.org\/scrum-based-translation\/","og_site_name":"Bibledit","article_modified_time":"2022-06-30T13:27:29+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/bibledit.org\/scrum-based-translation\/","url":"https:\/\/bibledit.org\/scrum-based-translation\/","name":"Scrum-based Translation | Bibledit","isPartOf":{"@id":"https:\/\/bibledit.org\/#website"},"datePublished":"2022-06-29T10:54:45+00:00","dateModified":"2022-06-30T13:27:29+00:00","breadcrumb":{"@id":"https:\/\/bibledit.org\/scrum-based-translation\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/bibledit.org\/scrum-based-translation\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/bibledit.org\/scrum-based-translation\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/bibledit.org\/"},{"@type":"ListItem","position":2,"name":"Scrum-based Translation"}]},{"@type":"WebSite","@id":"https:\/\/bibledit.org\/#website","url":"https:\/\/bibledit.org\/","name":"Bibledit","description":"Bible Translation Software","publisher":{"@id":"https:\/\/bibledit.org\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/bibledit.org\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/bibledit.org\/#organization","name":"FreeSoftwareConsultants","url":"https:\/\/bibledit.org\/","sameAs":[],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/bibledit.org\/#\/schema\/logo\/image\/","url":"https:\/\/bibledit.org\/wp-content\/uploads\/2022\/06\/cropped-bibleditlogoinkscape-copy.png","contentUrl":"https:\/\/bibledit.org\/wp-content\/uploads\/2022\/06\/cropped-bibleditlogoinkscape-copy.png","width":200,"height":108,"caption":"FreeSoftwareConsultants"},"image":{"@id":"https:\/\/bibledit.org\/#\/schema\/logo\/image\/"}}]}},"tpgb_featured_images":null,"tpgb_post_meta_info":{"get_date":"June 29, 2022","author_name":"Bibledit","author_url":"https:\/\/bibledit.org\/author\/jeannet\/","author_email":"jeannetbenschop@gmail.com","author_website":"http:\/\/www.bibledit.org","author_description":"","author_facebook":"","author_twitter":"","author_instagram":"","author_role":["administrator"],"author_avatar":"<img alt='' src='https:\/\/secure.gravatar.com\/avatar\/8ea006cbe3335c867123698b00c41517?s=200&#038;d=mm&#038;r=g' srcset='https:\/\/secure.gravatar.com\/avatar\/8ea006cbe3335c867123698b00c41517?s=400&#038;d=mm&#038;r=g 2x' class='avatar avatar-200 photo' height='200' width='200' loading='lazy'\/>","comment_count":0,"post_likes":0,"post_views":0},"tpgb_post_category":[],"_links":{"self":[{"href":"https:\/\/bibledit.org\/wp-json\/wp\/v2\/pages\/2143"}],"collection":[{"href":"https:\/\/bibledit.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/bibledit.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/bibledit.org\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/bibledit.org\/wp-json\/wp\/v2\/comments?post=2143"}],"version-history":[{"count":3,"href":"https:\/\/bibledit.org\/wp-json\/wp\/v2\/pages\/2143\/revisions"}],"predecessor-version":[{"id":2743,"href":"https:\/\/bibledit.org\/wp-json\/wp\/v2\/pages\/2143\/revisions\/2743"}],"wp:attachment":[{"href":"https:\/\/bibledit.org\/wp-json\/wp\/v2\/media?parent=2143"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}